GopalSaraf/Practicals/PSDL/include/proc/pic18lf46k40.inc
// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 0EC6h
// bitfield definitions
PIE4_TMR1IE_POSN                         equ 0000h
PIE4_TMR1IE_POSITION                     equ 0000h
PIE4_TMR1IE_SIZE                         equ 0001h
PIE4_TMR1IE_LENGTH                       equ 0001h
PIE4_TMR1IE_MASK                         equ 0001h
PIE4_TMR2IE_POSN                         equ 0001h
PIE4_TMR2IE_POSITION                     equ 0001h
PIE4_TMR2IE_SIZE                         equ 0001h
PIE4_TMR2IE_LENGTH                       equ 0001h
PIE4_TMR2IE_MASK                         equ 0002h
PIE4_TMR3IE_POSN                         equ 0002h
PIE4_TMR3IE_POSITION                     equ 0002h
PIE4_TMR3IE_SIZE                         equ 0001h
PIE4_TMR3IE_LENGTH                       equ 0001h
PIE4_TMR3IE_MASK                         equ 0004h
PIE4_TMR4IE_POSN                         equ 0003h
PIE4_TMR4IE_POSITION                     equ 0003h
PIE4_TMR4IE_SIZE                         equ 0001h
PIE4_TMR4IE_LENGTH                       equ 0001h
PIE4_TMR4IE_MASK                         equ 0008h
PIE4_TMR5IE_POSN                         equ 0004h
PIE4_TMR5IE_POSITION                     equ 0004h
PIE4_TMR5IE_SIZE                         equ 0001h
PIE4_TMR5IE_LENGTH                       equ 0001h
PIE4_TMR5IE_MASK                         equ 0010h
PIE4_TMR6IE_POSN                         equ 0005h
PIE4_TMR6IE_POSITION                     equ 0005h
PIE4_TMR6IE_SIZE                         equ 0001h
PIE4_TMR6IE_LENGTH                       equ 0001h
PIE4_TMR6IE_MASK                         equ 0020h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 0EC7h
// bitfield definitions
PIE5_TMR1GIE_POSN                        equ 0000h
PIE5_TMR1GIE_POSITION                    equ 0000h
PIE5_TMR1GIE_SIZE                        equ 0001h
PIE5_TMR1GIE_LENGTH                      equ 0001h
PIE5_TMR1GIE_MASK                        equ 0001h
PIE5_TMR3GIE_POSN                        equ 0001h
PIE5_TMR3GIE_POSITION                    equ 0001h
PIE5_TMR3GIE_SIZE                        equ 0001h
PIE5_TMR3GIE_LENGTH                      equ 0001h
PIE5_TMR3GIE_MASK                        equ 0002h
PIE5_TMR5GIE_POSN                        equ 0002h
PIE5_TMR5GIE_POSITION                    equ 0002h
PIE5_TMR5GIE_SIZE                        equ 0001h
PIE5_TMR5GIE_LENGTH                      equ 0001h
PIE5_TMR5GIE_MASK                        equ 0004h

// Register: PIE6
#define PIE6 PIE6
PIE6                                     equ 0EC8h
// bitfield definitions
PIE6_CCP1IE_POSN                         equ 0000h
PIE6_CCP1IE_POSITION                     equ 0000h
PIE6_CCP1IE_SIZE                         equ 0001h
PIE6_CCP1IE_LENGTH                       equ 0001h
PIE6_CCP1IE_MASK                         equ 0001h
PIE6_CCP2IE_POSN                         equ 0001h
PIE6_CCP2IE_POSITION                     equ 0001h
PIE6_CCP2IE_SIZE                         equ 0001h
PIE6_CCP2IE_LENGTH                       equ 0001h
PIE6_CCP2IE_MASK                         equ 0002h

// Register: PIE7
#define PIE7 PIE7
PIE7                                     equ 0EC9h
// bitfield definitions
PIE7_CWGIE_POSN                          equ 0000h
PIE7_CWGIE_POSITION                      equ 0000h
PIE7_CWGIE_SIZE                          equ 0001h
PIE7_CWGIE_LENGTH                        equ 0001h
PIE7_CWGIE_MASK                          equ 0001h
PIE7_NVMIE_POSN                          equ 0005h
PIE7_NVMIE_POSITION                      equ 0005h
PIE7_NVMIE_SIZE                          equ 0001h
PIE7_NVMIE_LENGTH                        equ 0001h
PIE7_NVMIE_MASK                          equ 0020h
PIE7_CRCIE_POSN                          equ 0006h
PIE7_CRCIE_POSITION                      equ 0006h
PIE7_CRCIE_SIZE                          equ 0001h
PIE7_CRCIE_LENGTH                        equ 0001h
PIE7_CRCIE_MASK                          equ 0040h
PIE7_SCANIE_POSN                         equ 0007h
PIE7_SCANIE_POSITION                     equ 0007h
PIE7_SCANIE_SIZE                         equ 0001h
PIE7_SCANIE_LENGTH                       equ 0001h
PIE7_SCANIE_MASK                         equ 0080h
PIE7_CWG1IE_POSN                         equ 0000h
PIE7_CWG1IE_POSITION                     equ 0000h
PIE7_CWG1IE_SIZE                         equ 0001h
PIE7_CWG1IE_LENGTH                       equ 0001h
PIE7_CWG1IE_MASK                         equ 0001h

// Register: PIR0
#define PIR0 PIR0
PIR0                                     equ 0ECAh
// bitfield definitions
PIR0_INT0IF_POSN                         equ 0000h
PIR0_INT0IF_POSITION                     equ 0000h
PIR0_INT0IF_SIZE                         equ 0001h
PIR0_INT0IF_LENGTH                       equ 0001h
PIR0_INT0IF_MASK                         equ 0001h
PIR0_INT1IF_POSN                         equ 0001h
PIR0_INT1IF_POSITION                     equ 0001h
PIR0_INT1IF_SIZE                         equ 0001h
PIR0_INT1IF_LENGTH                       equ 0001h
PIR0_INT1IF_MASK                         equ 0002h
PIR0_INT2IF_POSN                         equ 0002h
PIR0_INT2IF_POSITION                     equ 0002h
PIR0_INT2IF_SIZE                         equ 0001h
PIR0_INT2IF_LENGTH                       equ 0001h
PIR0_INT2IF_MASK                         equ 0004h
PIR0_IOCIF_POSN                          equ 0004h
PIR0_IOCIF_POSITION                      equ 0004h
PIR0_IOCIF_SIZE                          equ 0001h
PIR0_IOCIF_LENGTH                        equ 0001h
PIR0_IOCIF_MASK                          equ 0010h
PIR0_TMR0IF_POSN                         equ 0005h
PIR0_TMR0IF_POSITION                     equ 0005h
PIR0_TMR0IF_SIZE                         equ 0001h
PIR0_TMR0IF_LENGTH                       equ 0001h
PIR0_TMR0IF_MASK                         equ 0020h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 0ECBh
// bitfield definitions
PIR1_ADIF_POSN                           equ 0000h
PIR1_ADIF_POSITION                       equ 0000h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0001h
PIR1_ADTIF_POSN                          equ 0001h
PIR1_ADTIF_POSITION                      equ 0001h
PIR1_ADTIF_SIZE                          equ 0001h
PIR1_ADTIF_LENGTH                        equ 0001h
PIR1_ADTIF_MASK                          equ 0002h
PIR1_CSWIF_POSN                          equ 0006h
PIR1_CSWIF_POSITION                      equ 0006h
PIR1_CSWIF_SIZE                          equ 0001h
PIR1_CSWIF_LENGTH                        equ 0001h
PIR1_CSWIF_MASK                          equ 0040h
PIR1_OSCFIF_POSN                         equ 0007h
PIR1_OSCFIF_POSITION                     equ 0007h
PIR1_OSCFIF_SIZE                         equ 0001h
PIR1_OSCFIF_LENGTH                       equ 0001h
PIR1_OSCFIF_MASK                         equ 0080h
PIR1_PSPIF_POSN                          equ 0007h
PIR1_PSPIF_POSITION                      equ 0007h
PIR1_PSPIF_SIZE                          equ 0001h
PIR1_PSPIF_LENGTH                        equ 0001h
PIR1_PSPIF_MASK                          equ 0080h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 0ECCh
// bitfield definitions
PIR2_C1IF_POSN                           equ 0000h
PIR2_C1IF_POSITION                       equ 0000h
PIR2_C1IF_SIZE                           equ 0001h
PIR2_C1IF_LENGTH                         equ 0001h
PIR2_C1IF_MASK                           equ 0001h
PIR2_C2IF_POSN                           equ 0001h
PIR2_C2IF_POSITION                       equ 0001h
PIR2_C2IF_SIZE                           equ 0001h
PIR2_C2IF_LENGTH                         equ 0001h
PIR2_C2IF_MASK                           equ 0002h
PIR2_ZCDIF_POSN                          equ 0006h
PIR2_ZCDIF_POSITION                      equ 0006h
PIR2_ZCDIF_SIZE                          equ 0001h
PIR2_ZCDIF_LENGTH                        equ 0001h
PIR2_ZCDIF_MASK                          equ 0040h
PIR2_HLVDIF_POSN                         equ 0007h
PIR2_HLVDIF_POSITION                     equ 0007h
PIR2_HLVDIF_SIZE                         equ 0001h
PIR2_HLVDIF_LENGTH                       equ 0001h
PIR2_HLVDIF_MASK                         equ 0080h
PIR2_CMIF_POSN                           equ 0006h
PIR2_CMIF_POSITION                       equ 0006h
PIR2_CMIF_SIZE                           equ 0001h
PIR2_CMIF_LENGTH                         equ 0001h
PIR2_CMIF_MASK                           equ 0040h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 0ECDh
// bitfield definitions
PIR3_SSP1IF_POSN                         equ 0000h
PIR3_SSP1IF_POSITION                     equ 0000h
PIR3_SSP1IF_SIZE                         equ 0001h
PIR3_SSP1IF_LENGTH                       equ 0001h
PIR3_SSP1IF_MASK                         equ 0001h
PIR3_BCL1IF_POSN                         equ 0001h
PIR3_BCL1IF_POSITION                     equ 0001h
PIR3_BCL1IF_SIZE                         equ 0001h
PIR3_BCL1IF_LENGTH                       equ 0001h
PIR3_BCL1IF_MASK                         equ 0002h
PIR3_SSP2IF_POSN                         equ 0002h
PIR3_SSP2IF_POSITION                     equ 0002h
PIR3_SSP2IF_SIZE                         equ 0001h
PIR3_SSP2IF_LENGTH                       equ 0001h
PIR3_SSP2IF_MASK                         equ 0004h
PIR3_BCL2IF_POSN                         equ 0003h
PIR3_BCL2IF_POSITION                     equ 0003h
PIR3_BCL2IF_SIZE                         equ 0001h
PIR3_BCL2IF_LENGTH                       equ 0001h
PIR3_BCL2IF_MASK                         equ 0008h
PIR3_TX1IF_POSN                          equ 0004h
PIR3_TX1IF_POSITION                      equ 0004h
PIR3_TX1IF_SIZE                          equ 0001h
PIR3_TX1IF_LENGTH                        equ 0001h
PIR3_TX1IF_MASK                          equ 0010h
PIR3_RC1IF_POSN                          equ 0005h
PIR3_RC1IF_POSITION                      equ 0005h
PIR3_RC1IF_SIZE                          equ 0001h
PIR3_RC1IF_LENGTH                        equ 0001h
PIR3_RC1IF_MASK                          equ 0020h
PIR3_TX2IF_POSN                          equ 0006h
PIR3_TX2IF_POSITION                      equ 0006h
PIR3_TX2IF_SIZE                          equ 0001h
PIR3_TX2IF_LENGTH                        equ 0001h
PIR3_TX2IF_MASK                          equ 0040h
PIR3_RC2IF_POSN                          equ 0007h
PIR3_RC2IF_POSITION                      equ 0007h
PIR3_RC2IF_SIZE                          equ 0001h
PIR3_RC2IF_LENGTH                        equ 0001h
PIR3_RC2IF_MASK                          equ 0080h
PIR3_RXBNIF_POSN                         equ 0001h
PIR3_RXBNIF_POSITION                     equ 0001h
PIR3_RXBNIF_SIZE                         equ 0001h
PIR3_RXBNIF_LENGTH                       equ 0001h
PIR3_RXBNIF_MASK                         equ 0002h
PIR3_TXBNIF_POSN                         equ 0004h
PIR3_TXBNIF_POSITION                     equ 0004h
PIR3_TXBNIF_SIZE                         equ 0001h
PIR3_TXBNIF_LENGTH                       equ 0001h
PIR3_TXBNIF_MASK                         equ 0010h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 0ECEh
// bitfield definitions
PIR4_TMR1IF_POSN                         equ 0000h
PIR4_TMR1IF_POSITION                     equ 0000h
PIR4_TMR1IF_SIZE                         equ 0001h
PIR4_TMR1IF_LENGTH                       equ 0001h
PIR4_TMR1IF_MASK                         equ 0001h
PIR4_TMR2IF_POSN                         equ 0001h
PIR4_TMR2IF_POSITION                     equ 0001h
PIR4_TMR2IF_SIZE                         equ 0001h
PIR4_TMR2IF_LENGTH                       equ 0001h
PIR4_TMR2IF_MASK                         equ 0002h
PIR4_TMR3IF_POSN                         equ 0002h
PIR4_TMR3IF_POSITION                     equ 0002h
PIR4_TMR3IF_SIZE                         equ 0001h
PIR4_TMR3IF_LENGTH                       equ 0001h
PIR4_TMR3IF_MASK                         equ 0004h
PIR4_TMR4IF_POSN                         equ 0003h
PIR4_TMR4IF_POSITION                     equ 0003h
PIR4_TMR4IF_SIZE                         equ 0001h
PIR4_TMR4IF_LENGTH                       equ 0001h
PIR4_TMR4IF_MASK                         equ 0008h
PIR4_TMR5IF_POSN                         equ 0004h
PIR4_TMR5IF_POSITION                     equ 0004h
PIR4_TMR5IF_SIZE                         equ 0001h
PIR4_TMR5IF_LENGTH                       equ 0001h
PIR4_TMR5IF_MASK                         equ 0010h
PIR4_TMR6IF_POSN                         equ 0005h
PIR4_TMR6IF_POSITION                     equ 0005h
PIR4_TMR6IF_SIZE                         equ 0001h
PIR4_TMR6IF_LENGTH                       equ 0001h
PIR4_TMR6IF_MASK                         equ 0020h

