GopalSaraf/Practicals/PSDL/include/proc/pic18lf46k40.inc
// Register: ADACT
#define ADACT ADACT
ADACT                                    equ 0F56h
// bitfield definitions
ADACT_ADACT_POSN                         equ 0000h
ADACT_ADACT_POSITION                     equ 0000h
ADACT_ADACT_SIZE                         equ 0005h
ADACT_ADACT_LENGTH                       equ 0005h
ADACT_ADACT_MASK                         equ 001Fh
ADACT_ADACT0_POSN                        equ 0000h
ADACT_ADACT0_POSITION                    equ 0000h
ADACT_ADACT0_SIZE                        equ 0001h
ADACT_ADACT0_LENGTH                      equ 0001h
ADACT_ADACT0_MASK                        equ 0001h
ADACT_ADACT1_POSN                        equ 0001h
ADACT_ADACT1_POSITION                    equ 0001h
ADACT_ADACT1_SIZE                        equ 0001h
ADACT_ADACT1_LENGTH                      equ 0001h
ADACT_ADACT1_MASK                        equ 0002h
ADACT_ADACT2_POSN                        equ 0002h
ADACT_ADACT2_POSITION                    equ 0002h
ADACT_ADACT2_SIZE                        equ 0001h
ADACT_ADACT2_LENGTH                      equ 0001h
ADACT_ADACT2_MASK                        equ 0004h
ADACT_ADACT3_POSN                        equ 0003h
ADACT_ADACT3_POSITION                    equ 0003h
ADACT_ADACT3_SIZE                        equ 0001h
ADACT_ADACT3_LENGTH                      equ 0001h
ADACT_ADACT3_MASK                        equ 0008h
ADACT_ADACT4_POSN                        equ 0004h
ADACT_ADACT4_POSITION                    equ 0004h
ADACT_ADACT4_SIZE                        equ 0001h
ADACT_ADACT4_LENGTH                      equ 0001h
ADACT_ADACT4_MASK                        equ 0010h

// Register: ADCLK
#define ADCLK ADCLK
ADCLK                                    equ 0F57h
// bitfield definitions
ADCLK_ADCS_POSN                          equ 0000h
ADCLK_ADCS_POSITION                      equ 0000h
ADCLK_ADCS_SIZE                          equ 0006h
ADCLK_ADCS_LENGTH                        equ 0006h
ADCLK_ADCS_MASK                          equ 003Fh
ADCLK_ADCS0_POSN                         equ 0000h
ADCLK_ADCS0_POSITION                     equ 0000h
ADCLK_ADCS0_SIZE                         equ 0001h
ADCLK_ADCS0_LENGTH                       equ 0001h
ADCLK_ADCS0_MASK                         equ 0001h
ADCLK_ADCS1_POSN                         equ 0001h
ADCLK_ADCS1_POSITION                     equ 0001h
ADCLK_ADCS1_SIZE                         equ 0001h
ADCLK_ADCS1_LENGTH                       equ 0001h
ADCLK_ADCS1_MASK                         equ 0002h
ADCLK_ADCS2_POSN                         equ 0002h
ADCLK_ADCS2_POSITION                     equ 0002h
ADCLK_ADCS2_SIZE                         equ 0001h
ADCLK_ADCS2_LENGTH                       equ 0001h
ADCLK_ADCS2_MASK                         equ 0004h
ADCLK_ADCS3_POSN                         equ 0003h
ADCLK_ADCS3_POSITION                     equ 0003h
ADCLK_ADCS3_SIZE                         equ 0001h
ADCLK_ADCS3_LENGTH                       equ 0001h
ADCLK_ADCS3_MASK                         equ 0008h
ADCLK_ADCS4_POSN                         equ 0004h
ADCLK_ADCS4_POSITION                     equ 0004h
ADCLK_ADCS4_SIZE                         equ 0001h
ADCLK_ADCS4_LENGTH                       equ 0001h
ADCLK_ADCS4_MASK                         equ 0010h
ADCLK_ADCS5_POSN                         equ 0005h
ADCLK_ADCS5_POSITION                     equ 0005h
ADCLK_ADCS5_SIZE                         equ 0001h
ADCLK_ADCS5_LENGTH                       equ 0001h
ADCLK_ADCS5_MASK                         equ 0020h

// Register: ADREF
#define ADREF ADREF
ADREF                                    equ 0F58h
// bitfield definitions
ADREF_ADPREF_POSN                        equ 0000h
ADREF_ADPREF_POSITION                    equ 0000h
ADREF_ADPREF_SIZE                        equ 0002h
ADREF_ADPREF_LENGTH                      equ 0002h
ADREF_ADPREF_MASK                        equ 0003h
ADREF_ADNREF_POSN                        equ 0004h
ADREF_ADNREF_POSITION                    equ 0004h
ADREF_ADNREF_SIZE                        equ 0001h
ADREF_ADNREF_LENGTH                      equ 0001h
ADREF_ADNREF_MASK                        equ 0010h
ADREF_ADPREF0_POSN                       equ 0000h
ADREF_ADPREF0_POSITION                   equ 0000h
ADREF_ADPREF0_SIZE                       equ 0001h
ADREF_ADPREF0_LENGTH                     equ 0001h
ADREF_ADPREF0_MASK                       equ 0001h
ADREF_ADPREF1_POSN                       equ 0001h
ADREF_ADPREF1_POSITION                   equ 0001h
ADREF_ADPREF1_SIZE                       equ 0001h
ADREF_ADPREF1_LENGTH                     equ 0001h
ADREF_ADPREF1_MASK                       equ 0002h

// Register: ADCON1
#define ADCON1 ADCON1
ADCON1                                   equ 0F59h
// bitfield definitions
ADCON1_ADDSEN_POSN                       equ 0000h
ADCON1_ADDSEN_POSITION                   equ 0000h
ADCON1_ADDSEN_SIZE                       equ 0001h
ADCON1_ADDSEN_LENGTH                     equ 0001h
ADCON1_ADDSEN_MASK                       equ 0001h
ADCON1_ADGPOL_POSN                       equ 0005h
ADCON1_ADGPOL_POSITION                   equ 0005h
ADCON1_ADGPOL_SIZE                       equ 0001h
ADCON1_ADGPOL_LENGTH                     equ 0001h
ADCON1_ADGPOL_MASK                       equ 0020h
ADCON1_ADIPEN_POSN                       equ 0006h
ADCON1_ADIPEN_POSITION                   equ 0006h
ADCON1_ADIPEN_SIZE                       equ 0001h
ADCON1_ADIPEN_LENGTH                     equ 0001h
ADCON1_ADIPEN_MASK                       equ 0040h
ADCON1_ADPPOL_POSN                       equ 0007h
ADCON1_ADPPOL_POSITION                   equ 0007h
ADCON1_ADPPOL_SIZE                       equ 0001h
ADCON1_ADPPOL_LENGTH                     equ 0001h
ADCON1_ADPPOL_MASK                       equ 0080h

// Register: ADCON2
#define ADCON2 ADCON2
ADCON2                                   equ 0F5Ah
// bitfield definitions
ADCON2_ADMD_POSN                         equ 0000h
ADCON2_ADMD_POSITION                     equ 0000h
ADCON2_ADMD_SIZE                         equ 0003h
ADCON2_ADMD_LENGTH                       equ 0003h
ADCON2_ADMD_MASK                         equ 0007h
ADCON2_ADACLR_POSN                       equ 0003h
ADCON2_ADACLR_POSITION                   equ 0003h
ADCON2_ADACLR_SIZE                       equ 0001h
ADCON2_ADACLR_LENGTH                     equ 0001h
ADCON2_ADACLR_MASK                       equ 0008h
ADCON2_ADCRS_POSN                        equ 0004h
ADCON2_ADCRS_POSITION                    equ 0004h
ADCON2_ADCRS_SIZE                        equ 0003h
ADCON2_ADCRS_LENGTH                      equ 0003h
ADCON2_ADCRS_MASK                        equ 0070h
ADCON2_ADPSIS_POSN                       equ 0007h
ADCON2_ADPSIS_POSITION                   equ 0007h
ADCON2_ADPSIS_SIZE                       equ 0001h
ADCON2_ADPSIS_LENGTH                     equ 0001h
ADCON2_ADPSIS_MASK                       equ 0080h
ADCON2_ADMD0_POSN                        equ 0000h
ADCON2_ADMD0_POSITION                    equ 0000h
ADCON2_ADMD0_SIZE                        equ 0001h
ADCON2_ADMD0_LENGTH                      equ 0001h
ADCON2_ADMD0_MASK                        equ 0001h
ADCON2_ADMD1_POSN                        equ 0001h
ADCON2_ADMD1_POSITION                    equ 0001h
ADCON2_ADMD1_SIZE                        equ 0001h
ADCON2_ADMD1_LENGTH                      equ 0001h
ADCON2_ADMD1_MASK                        equ 0002h
ADCON2_ADMD2_POSN                        equ 0002h
ADCON2_ADMD2_POSITION                    equ 0002h
ADCON2_ADMD2_SIZE                        equ 0001h
ADCON2_ADMD2_LENGTH                      equ 0001h
ADCON2_ADMD2_MASK                        equ 0004h
ADCON2_ADCRS0_POSN                       equ 0004h
ADCON2_ADCRS0_POSITION                   equ 0004h
ADCON2_ADCRS0_SIZE                       equ 0001h
ADCON2_ADCRS0_LENGTH                     equ 0001h
ADCON2_ADCRS0_MASK                       equ 0010h
ADCON2_ADCRS1_POSN                       equ 0005h
ADCON2_ADCRS1_POSITION                   equ 0005h
ADCON2_ADCRS1_SIZE                       equ 0001h
ADCON2_ADCRS1_LENGTH                     equ 0001h
ADCON2_ADCRS1_MASK                       equ 0020h
ADCON2_ADCRS2_POSN                       equ 0006h
ADCON2_ADCRS2_POSITION                   equ 0006h
ADCON2_ADCRS2_SIZE                       equ 0001h
ADCON2_ADCRS2_LENGTH                     equ 0001h
ADCON2_ADCRS2_MASK                       equ 0040h

// Register: ADCON3
#define ADCON3 ADCON3
ADCON3                                   equ 0F5Bh
// bitfield definitions
ADCON3_ADTMD_POSN                        equ 0000h
ADCON3_ADTMD_POSITION                    equ 0000h
ADCON3_ADTMD_SIZE                        equ 0003h
ADCON3_ADTMD_LENGTH                      equ 0003h
ADCON3_ADTMD_MASK                        equ 0007h
ADCON3_ADSOI_POSN                        equ 0003h
ADCON3_ADSOI_POSITION                    equ 0003h
ADCON3_ADSOI_SIZE                        equ 0001h
ADCON3_ADSOI_LENGTH                      equ 0001h
ADCON3_ADSOI_MASK                        equ 0008h
ADCON3_ADCALC_POSN                       equ 0004h
ADCON3_ADCALC_POSITION                   equ 0004h
ADCON3_ADCALC_SIZE                       equ 0003h
ADCON3_ADCALC_LENGTH                     equ 0003h
ADCON3_ADCALC_MASK                       equ 0070h
ADCON3_ADTMD0_POSN                       equ 0000h
ADCON3_ADTMD0_POSITION                   equ 0000h
ADCON3_ADTMD0_SIZE                       equ 0001h
ADCON3_ADTMD0_LENGTH                     equ 0001h
ADCON3_ADTMD0_MASK                       equ 0001h
ADCON3_ADTMD1_POSN                       equ 0001h
ADCON3_ADTMD1_POSITION                   equ 0001h
ADCON3_ADTMD1_SIZE                       equ 0001h
ADCON3_ADTMD1_LENGTH                     equ 0001h
ADCON3_ADTMD1_MASK                       equ 0002h
ADCON3_ADTMD2_POSN                       equ 0002h
ADCON3_ADTMD2_POSITION                   equ 0002h
ADCON3_ADTMD2_SIZE                       equ 0001h
ADCON3_ADTMD2_LENGTH                     equ 0001h
ADCON3_ADTMD2_MASK                       equ 0004h
ADCON3_ADCALC0_POSN                      equ 0004h
ADCON3_ADCALC0_POSITION                  equ 0004h
ADCON3_ADCALC0_SIZE                      equ 0001h
ADCON3_ADCALC0_LENGTH                    equ 0001h
ADCON3_ADCALC0_MASK                      equ 0010h
ADCON3_ADCALC1_POSN                      equ 0005h
ADCON3_ADCALC1_POSITION                  equ 0005h
ADCON3_ADCALC1_SIZE                      equ 0001h
ADCON3_ADCALC1_LENGTH                    equ 0001h
ADCON3_ADCALC1_MASK                      equ 0020h
ADCON3_ADCALC2_POSN                      equ 0006h
ADCON3_ADCALC2_POSITION                  equ 0006h
ADCON3_ADCALC2_SIZE                      equ 0001h
ADCON3_ADCALC2_LENGTH                    equ 0001h
ADCON3_ADCALC2_MASK                      equ 0040h

// Register: ADACQ
#define ADACQ ADACQ
ADACQ                                    equ 0F5Ch
// bitfield definitions
ADACQ_ADACQ_POSN                         equ 0000h
ADACQ_ADACQ_POSITION                     equ 0000h
ADACQ_ADACQ_SIZE                         equ 0008h
ADACQ_ADACQ_LENGTH                       equ 0008h
ADACQ_ADACQ_MASK                         equ 00FFh
ADACQ_ADACQ0_POSN                        equ 0000h
ADACQ_ADACQ0_POSITION                    equ 0000h
ADACQ_ADACQ0_SIZE                        equ 0001h
ADACQ_ADACQ0_LENGTH                      equ 0001h
ADACQ_ADACQ0_MASK                        equ 0001h
ADACQ_ADACQ1_POSN                        equ 0001h
ADACQ_ADACQ1_POSITION                    equ 0001h
ADACQ_ADACQ1_SIZE                        equ 0001h
ADACQ_ADACQ1_LENGTH                      equ 0001h
ADACQ_ADACQ1_MASK                        equ 0002h
ADACQ_ADACQ2_POSN                        equ 0002h
ADACQ_ADACQ2_POSITION                    equ 0002h
ADACQ_ADACQ2_SIZE                        equ 0001h
ADACQ_ADACQ2_LENGTH                      equ 0001h
ADACQ_ADACQ2_MASK                        equ 0004h
ADACQ_ADACQ3_POSN                        equ 0003h
ADACQ_ADACQ3_POSITION                    equ 0003h
ADACQ_ADACQ3_SIZE                        equ 0001h
ADACQ_ADACQ3_LENGTH                      equ 0001h
ADACQ_ADACQ3_MASK                        equ 0008h
ADACQ_ADACQ4_POSN                        equ 0004h
ADACQ_ADACQ4_POSITION                    equ 0004h
ADACQ_ADACQ4_SIZE                        equ 0001h
ADACQ_ADACQ4_LENGTH                      equ 0001h
ADACQ_ADACQ4_MASK                        equ 0010h
ADACQ_ADACQ5_POSN                        equ 0005h
ADACQ_ADACQ5_POSITION                    equ 0005h
ADACQ_ADACQ5_SIZE                        equ 0001h
ADACQ_ADACQ5_LENGTH                      equ 0001h
ADACQ_ADACQ5_MASK                        equ 0020h
ADACQ_ADACQ6_POSN                        equ 0006h
ADACQ_ADACQ6_POSITION                    equ 0006h
ADACQ_ADACQ6_SIZE                        equ 0001h
ADACQ_ADACQ6_LENGTH                      equ 0001h
ADACQ_ADACQ6_MASK                        equ 0040h
ADACQ_ADACQ7_POSN                        equ 0007h
ADACQ_ADACQ7_POSITION                    equ 0007h
ADACQ_ADACQ7_SIZE                        equ 0001h
ADACQ_ADACQ7_LENGTH                      equ 0001h
ADACQ_ADACQ7_MASK                        equ 0080h

// Register: ADCAP
#define ADCAP ADCAP
ADCAP                                    equ 0F5Dh
// bitfield definitions
ADCAP_ADCAP_POSN                         equ 0000h
ADCAP_ADCAP_POSITION                     equ 0000h
ADCAP_ADCAP_SIZE                         equ 0005h
ADCAP_ADCAP_LENGTH                       equ 0005h
ADCAP_ADCAP_MASK                         equ 001Fh
ADCAP_ADCAP0_POSN                        equ 0000h
ADCAP_ADCAP0_POSITION                    equ 0000h
ADCAP_ADCAP0_SIZE                        equ 0001h
ADCAP_ADCAP0_LENGTH                      equ 0001h
ADCAP_ADCAP0_MASK                        equ 0001h
ADCAP_ADCAP1_POSN                        equ 0001h
ADCAP_ADCAP1_POSITION                    equ 0001h
ADCAP_ADCAP1_SIZE                        equ 0001h
ADCAP_ADCAP1_LENGTH                      equ 0001h
ADCAP_ADCAP1_MASK                        equ 0002h
ADCAP_ADCAP2_POSN                        equ 0002h
ADCAP_ADCAP2_POSITION                    equ 0002h
ADCAP_ADCAP2_SIZE                        equ 0001h
ADCAP_ADCAP2_LENGTH                      equ 0001h
ADCAP_ADCAP2_MASK                        equ 0004h
ADCAP_ADCAP3_POSN                        equ 0003h
ADCAP_ADCAP3_POSITION                    equ 0003h
ADCAP_ADCAP3_SIZE                        equ 0001h
ADCAP_ADCAP3_LENGTH                      equ 0001h
ADCAP_ADCAP3_MASK                        equ 0008h
ADCAP_ADCAP4_POSN                        equ 0004h
ADCAP_ADCAP4_POSITION                    equ 0004h
ADCAP_ADCAP4_SIZE                        equ 0001h
ADCAP_ADCAP4_LENGTH                      equ 0001h
ADCAP_ADCAP4_MASK                        equ 0010h

// Register: ADPRE
#define ADPRE ADPRE
ADPRE                                    equ 0F5Eh
// bitfield definitions
ADPRE_ADPRE_POSN                         equ 0000h
ADPRE_ADPRE_POSITION                     equ 0000h
ADPRE_ADPRE_SIZE                         equ 0008h
ADPRE_ADPRE_LENGTH                       equ 0008h
ADPRE_ADPRE_MASK                         equ 00FFh
ADPRE_ADPRE0_POSN                        equ 0000h
ADPRE_ADPRE0_POSITION                    equ 0000h
ADPRE_ADPRE0_SIZE                        equ 0001h
ADPRE_ADPRE0_LENGTH                      equ 0001h
ADPRE_ADPRE0_MASK                        equ 0001h
ADPRE_ADPRE1_POSN                        equ 0001h
ADPRE_ADPRE1_POSITION                    equ 0001h
ADPRE_ADPRE1_SIZE                        equ 0001h
ADPRE_ADPRE1_LENGTH                      equ 0001h
ADPRE_ADPRE1_MASK                        equ 0002h
ADPRE_ADPRE2_POSN                        equ 0002h
ADPRE_ADPRE2_POSITION                    equ 0002h
ADPRE_ADPRE2_SIZE                        equ 0001h
ADPRE_ADPRE2_LENGTH                      equ 0001h
ADPRE_ADPRE2_MASK                        equ 0004h
ADPRE_ADPRE3_POSN                        equ 0003h
ADPRE_ADPRE3_POSITION                    equ 0003h
ADPRE_ADPRE3_SIZE                        equ 0001h
ADPRE_ADPRE3_LENGTH                      equ 0001h
ADPRE_ADPRE3_MASK                        equ 0008h
ADPRE_ADPRE4_POSN                        equ 0004h
ADPRE_ADPRE4_POSITION                    equ 0004h
ADPRE_ADPRE4_SIZE                        equ 0001h
ADPRE_ADPRE4_LENGTH                      equ 0001h
ADPRE_ADPRE4_MASK                        equ 0010h
ADPRE_ADPRE5_POSN                        equ 0005h
ADPRE_ADPRE5_POSITION                    equ 0005h
ADPRE_ADPRE5_SIZE                        equ 0001h
ADPRE_ADPRE5_LENGTH                      equ 0001h
ADPRE_ADPRE5_MASK                        equ 0020h
ADPRE_ADPRE6_POSN                        equ 0006h
ADPRE_ADPRE6_POSITION                    equ 0006h
ADPRE_ADPRE6_SIZE                        equ 0001h
ADPRE_ADPRE6_LENGTH                      equ 0001h
ADPRE_ADPRE6_MASK                        equ 0040h
ADPRE_ADPRE7_POSN                        equ 0007h
ADPRE_ADPRE7_POSITION                    equ 0007h
ADPRE_ADPRE7_SIZE                        equ 0001h
ADPRE_ADPRE7_LENGTH                      equ 0001h
ADPRE_ADPRE7_MASK                        equ 0080h

