GopalSaraf/Practicals/PSDL/include/proc/pic18lf46k40.inc
// Register: BAUD1CON
#define BAUD1CON BAUD1CON
BAUD1CON                                 equ 0F9Fh
// bitfield definitions
BAUD1CON_ABDEN_POSN                      equ 0000h
BAUD1CON_ABDEN_POSITION                  equ 0000h
BAUD1CON_ABDEN_SIZE                      equ 0001h
BAUD1CON_ABDEN_LENGTH                    equ 0001h
BAUD1CON_ABDEN_MASK                      equ 0001h
BAUD1CON_WUE_POSN                        equ 0001h
BAUD1CON_WUE_POSITION                    equ 0001h
BAUD1CON_WUE_SIZE                        equ 0001h
BAUD1CON_WUE_LENGTH                      equ 0001h
BAUD1CON_WUE_MASK                        equ 0002h
BAUD1CON_BRG16_POSN                      equ 0003h
BAUD1CON_BRG16_POSITION                  equ 0003h
BAUD1CON_BRG16_SIZE                      equ 0001h
BAUD1CON_BRG16_LENGTH                    equ 0001h
BAUD1CON_BRG16_MASK                      equ 0008h
BAUD1CON_SCKP_POSN                       equ 0004h
BAUD1CON_SCKP_POSITION                   equ 0004h
BAUD1CON_SCKP_SIZE                       equ 0001h
BAUD1CON_SCKP_LENGTH                     equ 0001h
BAUD1CON_SCKP_MASK                       equ 0010h
BAUD1CON_RCIDL_POSN                      equ 0006h
BAUD1CON_RCIDL_POSITION                  equ 0006h
BAUD1CON_RCIDL_SIZE                      equ 0001h
BAUD1CON_RCIDL_LENGTH                    equ 0001h
BAUD1CON_RCIDL_MASK                      equ 0040h
BAUD1CON_ABDOVF_POSN                     equ 0007h
BAUD1CON_ABDOVF_POSITION                 equ 0007h
BAUD1CON_ABDOVF_SIZE                     equ 0001h
BAUD1CON_ABDOVF_LENGTH                   equ 0001h
BAUD1CON_ABDOVF_MASK                     equ 0080h
BAUD1CON_ABDEN1_POSN                     equ 0000h
BAUD1CON_ABDEN1_POSITION                 equ 0000h
BAUD1CON_ABDEN1_SIZE                     equ 0001h
BAUD1CON_ABDEN1_LENGTH                   equ 0001h
BAUD1CON_ABDEN1_MASK                     equ 0001h
BAUD1CON_ABDOVF1_POSN                    equ 0007h
BAUD1CON_ABDOVF1_POSITION                equ 0007h
BAUD1CON_ABDOVF1_SIZE                    equ 0001h
BAUD1CON_ABDOVF1_LENGTH                  equ 0001h
BAUD1CON_ABDOVF1_MASK                    equ 0080h
BAUD1CON_BRG161_POSN                     equ 0003h
BAUD1CON_BRG161_POSITION                 equ 0003h
BAUD1CON_BRG161_SIZE                     equ 0001h
BAUD1CON_BRG161_LENGTH                   equ 0001h
BAUD1CON_BRG161_MASK                     equ 0008h
BAUD1CON_CKTXP_POSN                      equ 0004h
BAUD1CON_CKTXP_POSITION                  equ 0004h
BAUD1CON_CKTXP_SIZE                      equ 0001h
BAUD1CON_CKTXP_LENGTH                    equ 0001h
BAUD1CON_CKTXP_MASK                      equ 0010h
BAUD1CON_RCIDL1_POSN                     equ 0006h
BAUD1CON_RCIDL1_POSITION                 equ 0006h
BAUD1CON_RCIDL1_SIZE                     equ 0001h
BAUD1CON_RCIDL1_LENGTH                   equ 0001h
BAUD1CON_RCIDL1_MASK                     equ 0040h
BAUD1CON_RCMT_POSN                       equ 0006h
BAUD1CON_RCMT_POSITION                   equ 0006h
BAUD1CON_RCMT_SIZE                       equ 0001h
BAUD1CON_RCMT_LENGTH                     equ 0001h
BAUD1CON_RCMT_MASK                       equ 0040h
BAUD1CON_RCMT1_POSN                      equ 0006h
BAUD1CON_RCMT1_POSITION                  equ 0006h
BAUD1CON_RCMT1_SIZE                      equ 0001h
BAUD1CON_RCMT1_LENGTH                    equ 0001h
BAUD1CON_RCMT1_MASK                      equ 0040h
BAUD1CON_SCKP1_POSN                      equ 0004h
BAUD1CON_SCKP1_POSITION                  equ 0004h
BAUD1CON_SCKP1_SIZE                      equ 0001h
BAUD1CON_SCKP1_LENGTH                    equ 0001h
BAUD1CON_SCKP1_MASK                      equ 0010h
BAUD1CON_TXCKP_POSN                      equ 0004h
BAUD1CON_TXCKP_POSITION                  equ 0004h
BAUD1CON_TXCKP_SIZE                      equ 0001h
BAUD1CON_TXCKP_LENGTH                    equ 0001h
BAUD1CON_TXCKP_MASK                      equ 0010h
BAUD1CON_TXCKP1_POSN                     equ 0004h
BAUD1CON_TXCKP1_POSITION                 equ 0004h
BAUD1CON_TXCKP1_SIZE                     equ 0001h
BAUD1CON_TXCKP1_LENGTH                   equ 0001h
BAUD1CON_TXCKP1_MASK                     equ 0010h
BAUD1CON_WUE1_POSN                       equ 0001h
BAUD1CON_WUE1_POSITION                   equ 0001h
BAUD1CON_WUE1_SIZE                       equ 0001h
BAUD1CON_WUE1_LENGTH                     equ 0001h
BAUD1CON_WUE1_MASK                       equ 0002h
BAUD1CON_W4E_POSN                        equ 0001h
BAUD1CON_W4E_POSITION                    equ 0001h
BAUD1CON_W4E_SIZE                        equ 0001h
BAUD1CON_W4E_LENGTH                      equ 0001h
BAUD1CON_W4E_MASK                        equ 0002h

// Register: PWM4DC
#define PWM4DC PWM4DC
PWM4DC                                   equ 0FA0h

// Register: PWM4DCL
#define PWM4DCL PWM4DCL
PWM4DCL                                  equ 0FA0h
// bitfield definitions
PWM4DCL_DC_POSN                          equ 0006h
PWM4DCL_DC_POSITION                      equ 0006h
PWM4DCL_DC_SIZE                          equ 0002h
PWM4DCL_DC_LENGTH                        equ 0002h
PWM4DCL_DC_MASK                          equ 00C0h
PWM4DCL_DC0_POSN                         equ 0006h
PWM4DCL_DC0_POSITION                     equ 0006h
PWM4DCL_DC0_SIZE                         equ 0001h
PWM4DCL_DC0_LENGTH                       equ 0001h
PWM4DCL_DC0_MASK                         equ 0040h
PWM4DCL_DC1_POSN                         equ 0007h
PWM4DCL_DC1_POSITION                     equ 0007h
PWM4DCL_DC1_SIZE                         equ 0001h
PWM4DCL_DC1_LENGTH                       equ 0001h
PWM4DCL_DC1_MASK                         equ 0080h
PWM4DCL_PWM4DC0_POSN                     equ 0006h
PWM4DCL_PWM4DC0_POSITION                 equ 0006h
PWM4DCL_PWM4DC0_SIZE                     equ 0001h
PWM4DCL_PWM4DC0_LENGTH                   equ 0001h
PWM4DCL_PWM4DC0_MASK                     equ 0040h
PWM4DCL_PWM4DC1_POSN                     equ 0007h
PWM4DCL_PWM4DC1_POSITION                 equ 0007h
PWM4DCL_PWM4DC1_SIZE                     equ 0001h
PWM4DCL_PWM4DC1_LENGTH                   equ 0001h
PWM4DCL_PWM4DC1_MASK                     equ 0080h
PWM4DCL_PWMPW0_POSN                      equ 0006h
PWM4DCL_PWMPW0_POSITION                  equ 0006h
PWM4DCL_PWMPW0_SIZE                      equ 0001h
PWM4DCL_PWMPW0_LENGTH                    equ 0001h
PWM4DCL_PWMPW0_MASK                      equ 0040h
PWM4DCL_PWMPW1_POSN                      equ 0007h
PWM4DCL_PWMPW1_POSITION                  equ 0007h
PWM4DCL_PWMPW1_SIZE                      equ 0001h
PWM4DCL_PWMPW1_LENGTH                    equ 0001h
PWM4DCL_PWMPW1_MASK                      equ 0080h

